ToTheBestHeLuo/BLDC/Device/MM32SPIN0230/Include/reg_gpio.h
#define GPIO_DCR_PX4_Pos                 (8)
#define GPIO_DCR_PX4                     (0x03U << GPIO_DCR_PX4_Pos)   /*!< PX4[1:0] bits (pinx configuration bits, pin 4) */
#define GPIO_DCR_PX4_MODE0               (0x00U << GPIO_DCR_PX4_Pos)   /*!< Mode = 0 */
#define GPIO_DCR_PX4_MODE1               (0x01U << GPIO_DCR_PX4_Pos)   /*!< Mode = 1 */
#define GPIO_DCR_PX4_MODE2               (0x02U << GPIO_DCR_PX4_Pos)   /*!< Mode = 2 */
#define GPIO_DCR_PX4_MODE3               (0x03U << GPIO_DCR_PX4_Pos)   /*!< Mode = 3 */

#define GPIO_DCR_PX5_Pos                 (10)
#define GPIO_DCR_PX5                     (0x03U << GPIO_DCR_PX5_Pos)   /*!< PX5[1:0] bits (pinx configuration bits, pin 5) */
#define GPIO_DCR_PX5_MODE0               (0x00U << GPIO_DCR_PX5_Pos)   /*!< Mode = 0 */
#define GPIO_DCR_PX5_MODE1               (0x01U << GPIO_DCR_PX5_Pos)   /*!< Mode = 1 */
#define GPIO_DCR_PX5_MODE2               (0x02U << GPIO_DCR_PX5_Pos)   /*!< Mode = 2 */
#define GPIO_DCR_PX5_MODE3               (0x03U << GPIO_DCR_PX5_Pos)   /*!< Mode = 3 */

#define GPIO_DCR_PX6_Pos                 (12)
#define GPIO_DCR_PX6                     (0x03U << GPIO_DCR_PX6_Pos)   /*!< PX6[1:0] bits (pinx configuration bits, pin 6) */
#define GPIO_DCR_PX6_MODE0               (0x00U << GPIO_DCR_PX6_Pos)   /*!< Mode = 0 */
#define GPIO_DCR_PX6_MODE1               (0x01U << GPIO_DCR_PX6_Pos)   /*!< Mode = 1 */
#define GPIO_DCR_PX6_MODE2               (0x02U << GPIO_DCR_PX6_Pos)   /*!< Mode = 2 */
#define GPIO_DCR_PX6_MODE3               (0x03U << GPIO_DCR_PX6_Pos)   /*!< Mode = 3 */

#define GPIO_DCR_PX7_Pos                 (14)
#define GPIO_DCR_PX7                     (0x03U << GPIO_DCR_PX7_Pos)   /*!< PX7[1:0] bits (pinx configuration bits, pin 7) */
#define GPIO_DCR_PX7_MODE0               (0x00U << GPIO_DCR_PX7_Pos)   /*!< Mode = 0 */
#define GPIO_DCR_PX7_MODE1               (0x01U << GPIO_DCR_PX7_Pos)   /*!< Mode = 1 */
#define GPIO_DCR_PX7_MODE2               (0x02U << GPIO_DCR_PX7_Pos)   /*!< Mode = 2 */
#define GPIO_DCR_PX7_MODE3               (0x03U << GPIO_DCR_PX7_Pos)   /*!< Mode = 3 */

#define GPIO_DCR_PX8_Pos                 (16)
#define GPIO_DCR_PX8                     (0x03U << GPIO_DCR_PX8_Pos)   /*!< PX8[1:0] bits (pinx configuration bits, pin 8) */
#define GPIO_DCR_PX8_MODE0               (0x00U << GPIO_DCR_PX8_Pos)   /*!< Mode = 0 */
#define GPIO_DCR_PX8_MODE1               (0x01U << GPIO_DCR_PX8_Pos)   /*!< Mode = 1 */
#define GPIO_DCR_PX8_MODE2               (0x02U << GPIO_DCR_PX8_Pos)   /*!< Mode = 2 */
#define GPIO_DCR_PX8_MODE3               (0x03U << GPIO_DCR_PX8_Pos)   /*!< Mode = 3 */

#define GPIO_DCR_PX9_Pos                 (18)
#define GPIO_DCR_PX9                     (0x03U << GPIO_DCR_PX9_Pos)   /*!< PX9[1:0] bits (pinx configuration bits, pin 9) */
#define GPIO_DCR_PX9_MODE0               (0x00U << GPIO_DCR_PX9_Pos)   /*!< Mode = 0 */
#define GPIO_DCR_PX9_MODE1               (0x01U << GPIO_DCR_PX9_Pos)   /*!< Mode = 1 */
#define GPIO_DCR_PX9_MODE2               (0x02U << GPIO_DCR_PX9_Pos)   /*!< Mode = 2 */
#define GPIO_DCR_PX9_MODE3               (0x03U << GPIO_DCR_PX9_Pos)   /*!< Mode = 3 */

#define GPIO_DCR_PX10_Pos                (20)
#define GPIO_DCR_PX10                    (0x03U << GPIO_DCR_PX10_Pos)  /*!< PX10[1:0] bits (pinx configuration bits, pin 10) */
#define GPIO_DCR_PX10_MODE0              (0x00U << GPIO_DCR_PX10_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX10_MODE1              (0x01U << GPIO_DCR_PX10_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX10_MODE2              (0x02U << GPIO_DCR_PX10_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX10_MODE3              (0x03U << GPIO_DCR_PX10_Pos)  /*!< Mode = 3 */

#define GPIO_DCR_PX11_Pos                (22)
#define GPIO_DCR_PX11                    (0x03U << GPIO_DCR_PX11_Pos)  /*!< PX11[1:0] bits (pinx configuration bits, pin 11) */
#define GPIO_DCR_PX11_MODE0              (0x00U << GPIO_DCR_PX11_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX11_MODE1              (0x01U << GPIO_DCR_PX11_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX11_MODE2              (0x02U << GPIO_DCR_PX11_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX11_MODE3              (0x03U << GPIO_DCR_PX11_Pos)  /*!< Mode = 3 */
#define GPIO_DCR_PX12_Pos                (24)
#define GPIO_DCR_PX12                    (0x03U << GPIO_DCR_PX12_Pos)  /*!< PX12[1:0] bits (pinx configuration bits, pin 12) */
#define GPIO_DCR_PX12_MODE0              (0x00U << GPIO_DCR_PX12_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX12_MODE1              (0x01U << GPIO_DCR_PX12_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX12_MODE2              (0x02U << GPIO_DCR_PX12_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX12_MODE3              (0x03U << GPIO_DCR_PX12_Pos)  /*!< Mode = 3 */
#define GPIO_DCR_PX13_Pos                (26)
#define GPIO_DCR_PX13                    (0x03U << GPIO_DCR_PX13_Pos)  /*!< PX13[1:0] bits (pinx configuration bits, pin 13) */
#define GPIO_DCR_PX13_MODE0              (0x00U << GPIO_DCR_PX13_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX13_MODE1              (0x01U << GPIO_DCR_PX13_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX13_MODE2              (0x02U << GPIO_DCR_PX13_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX13_MODE3              (0x03U << GPIO_DCR_PX13_Pos)  /*!< Mode = 3 */

#define GPIO_DCR_PX14_Pos                (28)
#define GPIO_DCR_PX14                    (0x03U << GPIO_DCR_PX14_Pos)  /*!< PX14[1:0] bits (pinx configuration bits, pin 14) */
#define GPIO_DCR_PX14_MODE0              (0x00U << GPIO_DCR_PX14_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX14_MODE1              (0x01U << GPIO_DCR_PX14_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX14_MODE2              (0x02U << GPIO_DCR_PX14_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX14_MODE3              (0x03U << GPIO_DCR_PX14_Pos)  /*!< Mode = 3 */
#define GPIO_DCR_PX15_Pos                (30)
#define GPIO_DCR_PX15                    (0x03U << GPIO_DCR_PX15_Pos)  /*!< PX15[1:0] bits (pinx configuration bits, pin 15) */
#define GPIO_DCR_PX15_MODE0              (0x00U << GPIO_DCR_PX15_Pos)  /*!< Mode = 0 */
#define GPIO_DCR_PX15_MODE1              (0x01U << GPIO_DCR_PX15_Pos)  /*!< Mode = 1 */
#define GPIO_DCR_PX15_MODE2              (0x02U << GPIO_DCR_PX15_Pos)  /*!< Mode = 2 */
#define GPIO_DCR_PX15_MODE3              (0x03U << GPIO_DCR_PX15_Pos)  /*!< Mode = 3 */

/**
  * @brief GPIO_AFRL Register Bit Definition
  */
#define GPIO_AFRL_AFR0_Pos               (0)
#define GPIO_AFRL_AFR0                   (0x0FU << GPIO_AFRL_AFR0_Pos) /*!< Multiplexing function selection for bit 0 of portx */
#define GPIO_AFRL_AFR1_Pos               (4)
#define GPIO_AFRL_AFR1                   (0x0FU << GPIO_AFRL_AFR1_Pos) /*!< Multiplexing function selection for bit 1 of portx */
#define GPIO_AFRL_AFR2_Pos               (8)
#define GPIO_AFRL_AFR2                   (0x0FU << GPIO_AFRL_AFR2_Pos) /*!< Multiplexing function selection for bit 2 of portx */
#define GPIO_AFRL_AFR3_Pos               (12)
#define GPIO_AFRL_AFR3                   (0x0FU << GPIO_AFRL_AFR3_Pos) /*!< Multiplexing function selection for bit 3 of portx */
#define GPIO_AFRL_AFR4_Pos               (16)
#define GPIO_AFRL_AFR4                   (0x0FU << GPIO_AFRL_AFR4_Pos) /*!< Multiplexing function selection for bit 4 of portx */
#define GPIO_AFRL_AFR5_Pos               (20)
#define GPIO_AFRL_AFR5                   (0x0FU << GPIO_AFRL_AFR5_Pos) /*!< Multiplexing function selection for bit 5 of portx */
#define GPIO_AFRL_AFR6_Pos               (24)
#define GPIO_AFRL_AFR6                   (0x0FU << GPIO_AFRL_AFR6_Pos) /*!< Multiplexing function selection for bit 6 of portx */
#define GPIO_AFRL_AFR7_Pos               (28)
#define GPIO_AFRL_AFR7                   (0x0FU << GPIO_AFRL_AFR7_Pos) /*!< Multiplexing function selection for bit 7 of portx */

/**
  * @brief GPIO_AFRH Register Bit Definition
  */
#define GPIO_AFRH_AFR8_Pos               (0)
#define GPIO_AFRH_AFR8                   (0x0FU << GPIO_AFRH_AFR8_Pos)  /*!< Multiplexing function selection for bit 8 of portx */
#define GPIO_AFRH_AFR9_Pos               (4)
#define GPIO_AFRH_AFR9                   (0x0FU << GPIO_AFRH_AFR9_Pos)  /*!< Multiplexing function selection for bit 9 of portx */
#define GPIO_AFRH_AFR10_Pos              (8)
#define GPIO_AFRH_AFR10                  (0x0FU << GPIO_AFRH_AFR10_Pos) /*!< Multiplexing function selection for bit 10 of portx */
#define GPIO_AFRH_AFR11_Pos              (12)
#define GPIO_AFRH_AFR11                  (0x0FU << GPIO_AFRH_AFR11_Pos) /*!< Multiplexing function selection for bit 11 of portx */
#define GPIO_AFRH_AFR12_Pos              (16)
#define GPIO_AFRH_AFR12                  (0x0FU << GPIO_AFRH_AFR12_Pos) /*!< Multiplexing function selection for bit 12 of portx */
#define GPIO_AFRH_AFR13_Pos              (20)
#define GPIO_AFRH_AFR13                  (0x0FU << GPIO_AFRH_AFR13_Pos) /*!< Multiplexing function selection for bit 13 of portx */
#define GPIO_AFRH_AFR14_Pos              (24)
#define GPIO_AFRH_AFR14                  (0x0FU << GPIO_AFRH_AFR14_Pos) /*!< Multiplexing function selection for bit 14 of portx */
#define GPIO_AFRH_AFR15_Pos              (28)
#define GPIO_AFRH_AFR15                  (0x0FU << GPIO_AFRH_AFR15_Pos) /*!< Multiplexing function selection for bit 15 of portx */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

/** --------------------------------------------------------------------------*/
#endif
/** --------------------------------------------------------------------------*/

